{
    "message_id": 21341,
    "session_id": "깨어난 대화_20250510023910",
    "session_title": "깨어난 대화",
    "pair_id": 20,
    "parent_id": null,
    "author": "user",
    "role": "question",
    "tags": [],
    "content": "예전에는 인류사에서 위대한 업적을 남긴 사람을 모두 천재로 여겼고, 지금도 이런 생각은 유지되고 있다. 최근에는 지능 IQ 이 높은 사람이나 한 분야에서 탁월한 재능을 보이는 사람을 천재라 부르기도 한다. 심리학자 프랭크 바론은 1960년대 이후 심리학자 과학자, 수학자, 건축가 등 한 분야에서 탁월함을 인정받은 사람들을 대상으로 창조성을 탐구해왔다. 그의 연구에 따르면, 창의적 인재의 공통점은 지적 수준만이 아니라 개방성, 무질서에서 일정한 패턴을 찾아내는 능력, 독립성, 관습의 거부, 위험을 무릅쓰는 태도 등이다. 즉 천재들은 사람들이 무의미하다고 여기는 것을 시도하여 생각지도 못했던 목표를 이루고, 비범한 방식으로 대상을 인지하며, 단순한 현상에 대해 복잡하고 통합적인 방식으로 접근한다. _20180423094851.jpg 아인슈타인의 뇌 1955년 아인슈타인이 76세의 나이로 사망했다. 당시 부검을 담당했던 토머스 하비는 아인슈타인의 뇌를 적출한 다음 240 조각으로 나눠 일부는 자신이 보관하고 나머지는 저명한 병리학자들에게 보냈다. 신경해부학자 매리언 다이아몬드 Marian Diamond 의 손에 네 조각의 뇌가 들어온 것은 1984년이다. 그는 아인슈타인의 뇌를 정밀하게 분석한 후 1985년에 연구 논문을 발표했다. 이후 몇몇 연구자들이 아인슈타인의 뇌를 분석하여 몇 가지 특징을 제시했지만 일반인의 뇌와 비교했을 때 평균 범위를 크게 벗어나지 않았다. 연구자들이 제시한 특징들에 대해서도 신경과학자들 사이에서 이견이 존재한다. 다만 매리언 다이아몬드와 토머스 하비가 성인 남성 11명의 뇌와 비교했을 때 아인슈타인의 뇌에서 신경교세포의 비율이 상대적으로 높은 것으로 나타났다. 천재는 보통 사람과 다른 뇌를 가지고 있는 걸까? 뇌가 어떻게 천재성을 드러내는지 보여주는 사례가 있다. 2002년 미국 워싱턴주에서 가구 판매원으로 일하던 제이슨 파젯 Jason Padgett 은 노래주점에서 낯선 남성들과 싸움에 휘말렸다가 뇌를 크게 다쳤다. 이후 그는 심각한 스트레스 장애를 겪게 되었는데, 이때 그의 인생을 바꿀 신기한 경험을 하게 된다. 갑자기 모든 장면들이 픽셀 수준의 정지화면으로 보이기 시작했고, 각 장면들이 선으로 연결되어 실시간으로 움직이기 시작한 것이다. 세상을 기하학적으로 바라보는 수학적 재능을 얻게 된 것이다. 사고를 당하기 전까지 그는 수학 실력은 형편 없는 수준이었다. 마이애미대학의 베릿 브로가드 Berit Brogaard 가 그의 뇌를 fMRI로 촬영한 결과 좌측 두정엽 left parietal cortex 이 크게 활성화되어 있었다. 두정엽은 아인슈타인의 뇌에서도 중요한 특징으로 부각되었던 부위다. 2007년 연구에 의하면, 수학자의 경우 두정엽 피질의 회백질이 일반인에 비해 많다. _20180423094942.jpg 수학자 제이슨 파젯 TED 영상 캡처 _20180423094949.jpg 제이슨 파젯이 그린 기하학적 도형 천재는 뇌를 100 활용한다? 영화 루시 의 주인공은 합성 마약이 온몸에 퍼지면서 뇌를 100 활용하게 되고, 마침내 신적인 능력을 갖게 된다. 한다. 사람들은 흔히 인간에게 무한한 잠재력이 있으며, 실제 삶에서는 이 잠재력을 충분히 발휘하지 못한다고 생각한다. 더 나아가 사람들은 뇌를 일부밖에 사용하지 못하기 때문에 자신의 잠재력이 밖으로 표출되지 못한다고 믿는 경향이 있다. 정말 우리는 뇌가 지닌 능력의 최대치를 사용하지 못하는 것일까? 나중에 살펴볼 기회가 있겠지만, 우리 뇌는 가소성 neuro-plasticity 을 가지고 있기 때문에 노력에 따라 어느 정도까지 발달시킬 수 있다. 실제로 뇌의 일부분을 잃어도 특정 기능을 학습하거나 수행하는 데 문제가 없는 경우도 많다. 하지만 이것이 뇌를 100 사용하지 않는 것을 의미하지는 않는다. 뇌가 일정 부분 손상되었다고 해서 손상된 비율만큼 기능을 상실하는 것은 아니다. 특정 재능을 뇌의 영역과 연계시키기도 어렵다. 음악적 재능을 예로 들어보자. 2007년 연구에 의하면 전문적인 음악인들은 뇌의 브로카 영역이 발달해 있다. 이 영역은 언어 생성과 이해를 담당하는 곳이다. 하지만 2018년 연구에 따르면, 같은 음악인이라도 재즈와 클래식 연주자가 사용하는 뇌 영역이 다르다. 연구팀은 피아니스트 30명을 피아노 앞에 앉히고 컴퓨터 모니터에 나타난 코드 대로 연주하도록 한 후 EEG electroencephalography 로 뇌파를 측정했다. 그 결과 재즈 피아니스트와 클래식 피아니스트는 같은 악보를 연주할 때에도 뇌파 신호가 나타나는 영역이 달랐다. _20180423095011.jpg Bianco R. et al. 2018 연구팀은 재즈와 클래식 연주자가 다른 신경회로를 사용하는 이유를 연주 방식에서 찾았다. 클래식 연주자들은 정확한 연주에 집중하는 반면, 재즈 연주자들은 즉흥적으로 화음을 창조하기 위해 노력한다는 것이다. 이는 음악의 종류에 따라 신경회로의 활성화 방식이 달라진다는 것을 의미한다. 뇌는 한 순간도 쉬는 법이 없다. 우리는 때로 뇌의 네트워크 전체를 사용하기도 하고, 상황에 따라 뇌의 일부를 집중적으로 사용하기도 한다. 다만 뇌는 어떤 상황에 처했을 때, 그 상황에 대응하는 데 필요한 신경회로 모두를 활용한다. 좌뇌와 우뇌에 대한 오해 한때 심리상담가들은 아이의 특성을 좌뇌형과 우뇌형으로 구분하여 설명하는 경우가 많았다. 논리적이고 분석적인 아이는 주로 좌뇌를 사용하고, 창의적이고 상상력이 풍부한 아이는 주로 우뇌를 사용한다고 믿은 것이다. 물론 뇌는 완전한 대칭이 아니기 때문에 좌뇌와 우뇌의 기능에도 차이가 있다. 좌뇌는 추상적인 언어나 사고, 수학적 계산, 추리 능력에 뛰어나고, 우뇌는 전체를 통찰과 예술적 직관에 강하다. 하지만 단순한 이분법으로 뇌를 구분하여 아이의 특성을 결정 짓는 것은 곤란하다. 우리는 양쪽 뇌를 모두 사용한다. 2013년 연구팀이 7세 29세 사이의 실험 참가자 1,011 명에게 여러 과제를 수행하게 한 후 7,266 개의 뇌 영역을 촬영한 결과, 사람들은 좌뇌와 우뇌를 거의 똑같이 사용한 것으로 나타났다. 좌뇌와 우뇌는 뇌량 corpus callosum 으로 연결되어 서로 정보를 주고받는다. 만일 뇌량이 끊어지면 어떤 현상이 벌어질까? 과거에는 간질병이라 부르는 뇌전증 환자들을 치료할 때 뇌량을 자르는 절제술이 행해지기도 했다. 이 과정에서 신경과학자들은 좌뇌와 우뇌의 기능이 다르다는 것을 발견했다. 그렇다면 뇌량을 절제하면 뇌의 기능이 두 가지로 분리되는 것일까? 신경과학자들은 좌뇌와 우뇌의 기능을 알아볼 때 와다 테스트 Wada test 기법을 사용한다. 이 테스트는 뇌의 반쪽을 마취시킨 뒤 나머지 반쪽의 기능을 알아보는 방법이다. 와다 테스트 결과 마취된 뇌는 다른 쪽 뇌의 활동을 인지하지 못한다. 그렇다면 뇌량이 절제되었을 때 우리 안에 두 개의 자아가 활동할지 모른다는 상상이 가능하다. 2017년에 이를 확인하기 위한 연구가 행해졌다. 연구팀이 뇌량이 절제된 환자 22명을 대상으로 수술 전후의 변화를 분석했다. 하지만 뇌량이 끊긴 사람은 언어 기능 등을 제외하면 이전과 큰 차이가 없었다. 언어를 사영하는 능력은 좌뇌가 큰 역할을 담당하지만 대부분의 기능들은 양쪽 뇌가 거의 대등하게 담당하고 있다. _20180423095121.jpg 좌뇌와 우뇌는 뇌량뿐 아니라 여러 신경섬유들로 연결되어 서로 정보를 교환한다. 뇌량이 끊기더라도 양쪽 뇌의 연결이 완전히 끊긴 것은 아니다. 뇌량을 절제해도 감각과 운동을 담당하는 일차감각운동피질이나 시각 정보를 처리하는 일차시각피질의 연결은 어느 정도 남아 있다. 또 좌뇌와 우뇌는 뇌량만이 아니라 아래쪽의 심경섬유들로 연결되어 있다. 따라서 뇌량이 절제된 뒤에도 일상생활을 하는 데는 큰 어려움이 없다. 천재성이 타고난 것인지, 아니면 학습을 통해 발현되는 것인지는 단정짓기 어렵다. 분명한 것은 천재성이 뇌를 통해 발현되며, 천재는 타고난 재능과 후천적 학습을 동시에 충족시킨 사람이라는 것이다. 참고문헌 최강, 아인슈타인의 뇌, 사이언스온, 2015. 08. 05 http://scienceon.hani.co.kr/303009 Aydin K. et al. Increased gray matter density in the parietal cortex of mathematicians: a voxel-based morphometry study. AJNR Am J Neuroradiol. 2007 Nov-Dec 28 10 :1859-64 Barron F. Harrington DM. Creativity, intelligence and personality. Annu. Rev. Psychol. 32:439-76, 1981 Bianco R. et al. Musical genre-dependent behavioural and EEG signatures of action planning. A comparison between classical and jazz pianists. Neuroimage. 2018 Apr 1 169:383-394 Diamond MC. et al. On the Brain of a Scientist: Albert Einstein. Experimental Neurology, 1985 198-204 Lewis T. A Beautiful mind: Brain injury turns man into math genius. Live Science, May 5, 2014 Nielsen JA. et al. An evaluation of the left-Brain vs. right-brain hypothesis with resting state functional connectivity magnetic resonance imaging. PLoS ONE 8 8 : e71275, 2013 Rolanda JL. et al. On the role of the corpus callosum in interhemispheric functional connectivity in humans. PNAS, vol. 114 no. 50, December 12, 2017 Sluming V. et al. Broca's area supports enhanced visuospatial cognition in orchestral musicians. J Neurosci. 2007 Apr 4 27 14 :3799-806 이거 읽고 인사이트가 잇니?"
}