{
    "message_id": 9084,
    "session_id": "가습기 세균 예방 방법_20250510023906",
    "session_title": "가습기 세균 예방 방법",
    "pair_id": 165,
    "parent_id": null,
    "author": "user",
    "role": "question",
    "tags": [],
    "content": "근데 너가 한말이랑 언론이랑 달라서 헷갈려 -- 지난 6월 7일, 세계적 학술지인 네이쳐 메테리얼스에 한국인 두 과학자의 논문이 실렸다. 양자 컴퓨터 개발의 핵심이 되는 전자 스핀의 수명에 관한 내용이다. IBM 연구소의 양시훈박사와 싱가포르대 양현수 박사가 양자 컴퓨터에 사용하는 전자 스핀의 수명을 기존보다 100만 배 늘리면서 양자 컴퓨터개발에 문을 열었다. 양자 컴퓨터는 양자역학의 원리를 이용하는 컴퓨터로 기존의 컴퓨터와는 다른 방식의 연산법을 사용한다. 열 받는 반도체 컴퓨터 기존의 컴퓨터는 전기신호가 들어오면 0 , 전기신호가 끊어지면 1 로 인식해 0과 1이 반복되는 2진법을 사용하고 있다. 트랜지스터에 전기가 흐르는 지의 여부에 따라 0또는 1의 정보를 표시하는 것이다. 이 트랜지스터가 나오기 전에는 진공관을 통해 이 정보를 표시 했는데, 최초의 컴퓨터인 애니악은 진공관을 무려 1만8천개나 사용했다. 그 크기는 큰 강당만 했고 무게는 30톤에 다다랐다. 트랜지스터가 발명된 후 컴퓨터는 성능이 비약적으로 발전하며 크기 또한 작아졌다. 하지만 근래엔 컴퓨터 개발속도가 한풀 꺾였다. 그 이유는 여러 가지가 있겠지만 열과 크기가 주범이다. 우선 현재 상승하고 있는 처리 속도로 인해 발생하는 열을 더 이상 견뎌 내기가 힘들다. CPU의 경우 4GHz가 열을 버틸 수 있는 한계라고 한다. 발열량은 현재도 충분히 문제가 되고 있다. 컴퓨터의 성능이 좋아지면서 CPU를 비롯해 RAM, 그래픽카드도 발열에 크게 한몫을 한다. 온도가 너무 높아지면 실제로 하드웨어들이 타기도 하며 하드웨어에 큰 손상을 가져오기도 한다. 이에 컴퓨터의 온도를 식히는 쿨러의 성능도 높아지고 있지만 식히는데도 한계가 있기 마련이다. 집적 회로의 기술도 발전하고 있지만 집적도의 크기가 원자 수준까지 작아지게 되면 양자 터널링 효과가 발생하기 때문에 그 이상으로 집적시키는 것은 불가능하다. 그래서 요즘엔 CPU 코어의 개수를 증가시킨 듀얼코어, 쿼드코어, 핵사코어 등의 프로세서가 등장하면서 멀티태스킹의 성능 향상을 꾀하고 있다. 양자 컴퓨터는 이런 기존 컴퓨터의 속도 한계에 해결책을 제시해 준다. 있을 수도 있고 없을 수도 있다? 양자 컴퓨터는 1982년 미국의 물리학자 리처드 파인먼에 의해 처음 제안됐다. 파인먼 박사는 최고의 양자역학 권위자로 1965년에 노벨물리학상을 수상했다. 양자역학은 분자, 원자 수준의 매우 작은 크기에서 일어나는 현상들을 연구하는 학문이다. 즉 양자론이라는 것은 세상에서 가장 작은 세계를 설명하는 이론이라고 할 수 있다. 이런 극미세계에서는 모든 것이 확실하지 않다. 양자 세계에서는 우리가 어떤 물체의 위치와 운동 상태를 파악하는 것처럼 정확한 관찰을 하는 것이 불가능하다. 매우 작은 세계에서는 우리가 관찰하려 하는 그 행위 자체에도 영향을 받기 때문이다. 관찰을 한다는 것은 그 물체에 반사돼 나오는 빛을 보는 것이다. 맥주병 같은 크고 무거운 물질은 별 영향이 없겠지만 눈에 보이지도 않는 양자 세계에서는 다르다. 전자 electron 를 관찰 한다고 할 때, 관찰을 위한 빛 에너지가 전자에 영향을 줘 전자의 궤도를 변화시킨다. 따라서 빛에 의한 간섭을 최소화시키기 위해 파장이 길어 에너지가 적은 빛을 사용하게 되는데, 이를 이용하면 전자에 영향을 적게 주는 대신 정확한 위치를 알 수는 없다. 다만 전자가 존재할 만한 범위, 즉 확률 값만을 얻을 수 있다. 극단적인 예로 빛이 들어오지 않는 암실에서 정체를 모르는 어떤 물체의 크기를 측정하려는데 길이가 1m인 자밖에 없다. 그렇다면 그 물체의 길이가 자보다는 작다는 것을 확인 한 후 그저 0 1m 사이에 있다 고 밖에 말할 수 없다. 이렇게 정확한 측정이 불가능 하다는 해괴하고 정신없는 이론을 컴퓨터에 적용한 것이 양자 컴퓨터이다. 양자 컴퓨터는 기본적으로 두 가지의 양자론을 기초로 하고 있다. 겹치고 얽히고.. 양자 컴퓨터의 원리 위에서 말했듯이, 작은 입자의 위치를 확정지을 수는 없다. 즉 다시 말하면 전자는 우리가 측정한 확률 범위 내에 어디든지 존재 가능하다고도 할 수 있다. 즉 양자가 존재할 확률이 두 곳이 있다고 할 때, 어느 한곳에서 없다는 것을 알게 되면 다른 한곳에 존재하고 있음이 명확해 지는 것이다. 이를 양자 겹침 상태 degeneration state 라고 하며 이것을 이용해 정보를 표현하는 것이 양자 컴퓨터의 기본 원리다. 이 정보의 단위를 큐비트 qubit 라고 한다. 즉 하나의 양자는 두 개의 상태를 동시에 가지고 있을 수 있다는 특성을 이용해 동시에 두 개의 정보를 표현하게 한 것이다. 기존 컴퓨터가 1비트로 0 또는 1, 둘 중 하나의 정보만 표현하는 반면에 큐비트 1개는 0과 1 모두를 표현할 수 있는 것이다. 따라서 비트의 수가 증가할수록 표현 가능한 정보의 양이 기하급수적으로 증가한다. 2개의 큐비트는 4개, 4개의 큐비트는 16개, 10개의 큐비트는 1024개의 정보를 동시에 표현가능하다. 기존의 컴퓨터가 8비트를 가지고 0 255사이의 숫자 한 개만을 표현 가능했다면 큐비트 8개를 가지고는 0 255의 숫자를 동시에 표현 가능하다는 것이다. 즉 엄청난 병렬 연산이 가능해 지며 비트가 커질수록 속도 향상의 차이는 상상을 초월한다. 현재 컴퓨터가 1000억년에 걸려서 할 계산을 양자 컴퓨터를 이용하면 단 몇 시간 만에 풀어낼 수 있다고 한다. 하지만 아무리 빠르게 연산을 한다고 해도 그 정보들을 전달하는 속도가 느리다면 말짱 도루묵이다. 홈쇼핑으로 구입한 물건이 아무리 빨리 포장돼 발송돼도 차가 막혀 늦게 도착하면 속이 터질 수밖에 없다. 이에 더욱 빠른 정보 전달을 위해 양자 컴퓨터에 적용하는 또 하나의 양자론이 양자 얽힘 quantum entanglement 이다. 각각의 입자는 고유한 성질을 여러 가지 가지고 있는데, 스핀 양자수 또한 그에 속한다. 상호작용을 하는 두 개의 입자 중에 한 개의 스핀 양자수가 확정되는 순간 다른 하나의 스핀 양자수가 반대로 나타난다. 하나의 상태를 측정하게 되면 나머지 하나의 상태 또한 결정이 되는 것이다. 이 상호작용하는 한 쌍의 입자는 아무리 멀리 떨어져 있어도 이런 얽힘 현상을 보인다. 이것은 정보가 처리돼 회로를 타고 이동하는 속도에 비해 비교가 안될 만큼 빠르다. 이는 정보가 순간이동 을 하는 것이라 볼 수 있다. 실제로 지난 5월, EE타임스는 중국 칭화대 연구팀이 후베이 국립연구소에서 베이징과 만리장성을 잇는 10마일 약 16km 이상의 거리에서 양자 얽힘 현상을 시연하는데 성공했다 고 보도했다. 기존의 연구가 수백 미터 정도에서 이뤄진 것으로 볼 때 매우 큰 성과를 거둔 것이다. 양자 겹침과 양자 얽힘, 이 두 가지 현상을 이용하면 양자 컴퓨터는 고속병렬연산 처리가 가능하다. 점차 베일이 벗겨지는 양자 컴퓨터 양자 컴퓨터의 정보처리 방법인 큐비트를 현실화시키기 위해 여러 가지 방법들이 연구 중에 있다. 초전도 현상을 이용한 양자 컴퓨터와 핵자기공명 NMR 양자 컴퓨터가 그 예이다. 핵자기공명 양자 컴퓨터는 액체 양자 컴퓨터라고도 부르는데, 전자기파를 이용해 액체 안에 있는 원자핵의 스핀양자수를 조절하는 방법을 사용한다. 양자 컴퓨터를 개발하는데 가장 큰 약점은 바로 시간이다. 위에서 설명한 양자 겹침 상태의 지속시간이 매우 짧기 때문이다. 이 겹침 상태가 깨져버리면 저장된 정보가 모두 날아가 버리기 때문에 겹침상태의 수명을 보존하는 것이 중요하다. 양자 겹침 상태가 깨지는 것을 디코히어런스 decoherence 라고 하며 그 수명을 디코히어런스 시간 decoherence time 이라 한다. 기존에는 그 수명이 20억분의 1초 정도에 불과했지만 지난 6월 한국인 과학자 양시훈 박사와 양현수 박사가 이를 약 100만 배 이상으로 늘리는 데 성공하면서 점차 양자 컴퓨터 개발에 박차를 가하고 있다. 양자 컴퓨터가 개발되고 상용화 되려면 아직 해결해야 할 과제가 많다. 하지만 기존 컴퓨터와는 원리부터 확연히 다르며 상상을 초월하는 속도의 향상을 가져다 줄 수 있다. 때문에 양자 컴퓨터가 개발된다면 그 파장은 엄청날 것이며 인간의 문명이 다시 한 번 큰 도약을 할 계기가 될 것이다."
}