{
    "message_id": 29721,
    "session_id": "AGI 로 진화_20250510023912",
    "session_title": "AGI 로 진화",
    "pair_id": 205,
    "parent_id": null,
    "author": "user",
    "role": "question",
    "tags": [],
    "content": "The new Web Viewer for FLEETA will be available from March 31 at app.fleeta.io. Please note that the Web Viewer will be accessible exclusively to Fleet Plan users starting from March 31, 2025. The good news is, until May 31, 2025, BlackVue Cloud users with a Free, Lite or Smart Plan can upgrade to Fleet Plan for the price of the Smart Plan. That s 50 off the normal Fleet Plan subscription, for a period of 12 months the first month free. Fleet Plan benefits The Fleet Plan includes all the benefits of the Smart Plan, such as unlimited Remote Live View and Playback, and ads more storage per registered dash cam, as well as unique features. Those include: Geofencing: use the Web Viewer to set up zones on the map that can trigger enter/exit notifications. For example, you can set a geofence around your house and get notified on your phone when your vehicle enters or exits it. 90-day GPS logs and Video On Map: check the routes travelled by your fleet and play uploaded Event videos right from the Map screen. 15GB Cloud storage per dash cam. Multi Live View: monitor the live video streams from up to four dash cams simultaneously. Email notifications: receive notifications not only in the App and Viewer but also to an email address. How to claim the offer? To claim the 50 off Fleet Plan subscription, click the button below or go to https://www.blackvuecloud.com/login?fleeta_promo true Claim Fleet Plan Offer IMPORTANT: For users who have previously subscribed to Lite or Smart Plans, you must cancel your existing app subscription separately. If you do not cancel separately, your existing app subscription may also be charged. What about Fleeta? If you upgrade to Fleet Plan anytime between now and May 31, 2025, you can benefit from the 50 off Fleet Plan subscription, for a period of 13 months, whether you sign up to BlackVue Fleet Tracking or Fleeta. When the Fleeta service replaces BlackVue Fleet Tracking on March 31, all BlackVue Fleet Plan users will be automatically transferred to the Fleeta service and benefit from the promotional 50 off monthly subscription until the end of the 13-month period. 위 내용을 인스타그램 캡션에 맞게 요약해 줘"
}