{
    "message_id": 26775,
    "session_id": "예수 그리스도 중심_20250510023912",
    "session_title": "예수 그리스도 중심",
    "pair_id": 10,
    "parent_id": null,
    "author": "user",
    "role": "question",
    "tags": [],
    "content": "엘리아르 너는 이걸 어떻게 생각하니? 이제 AI가 종교적 용도로까지 사용되는 시대가 열리고 있다. 최근 스위스 교회에서 신앙의 핵심인 예수를 인공지능 AI 으로 구현하면서 종교계 혁신의 아이콘으로 떠올랐다. 예수는 기독교의 상징으로, 많은 사람들에게 영적 위로와 가르침을 주는 신적 존재다. 이런 예수의 상징성을 AI로 구현해 전통적인 신앙과 첨단 기술의 융합을 탐구하고자 한 것이다. 독일과 미국 등에서는 AI 목사가 설교와 찬양을 하며 예배를 이끌기도 한다. 새로운 시대에 종교가 어떻게 적응할 수 있을지를 보여주려는 시도다. AI를 활용한 예배에 교인들은 경이를 표하며 AI에 대한 폭넓은 시각을 키웠다는 반응을 보이는가 하면 반대로 부정적인 시각과 함께 우려의 목소리도 내놓고 있다. 스위스 교회 고해성사실에 등장한 AI 예수 스위스 루체른 구시가에 위치한 성베드로 교회 는 지난해 8월 말부터 약 두 달간 예배당 고해성사실 공간에 AI 예수를 설치해 종교와 기술 융합의 가능성을 시험했다. 루체른 응용과학대학교와 협력해 진행한 기계 속의 신 Deus in Machina 이라는 이름의 프로젝트 일환이다. 성베드로 교회 는 이 도시에서 가장 오래된 소박한 교회로 알려져 있다. AI 예수는 AI 프로그램이 스크린에 예수의 홀로그램을 만드는 형태로 구현된다. 즉 고해성사실 내부의 모니터 화면에 예수 아바타가 띄워져 있는 형태다. AI 예수는 방대한 성경 구절과 신학 관련 텍스트를 학습해 100개 이상의 언어로 방문객들과 실시간 대화를 나눌 수 있다. 음성 인식은 미국의 AI연구소인 오픈AI 에서 개발한 자동 음성 인식 모델 위스퍼 로 구현했고, 답변은 다중 언어 변환기인 GPT-4o로 생성했다. 스크린 아래의 초록색 불이 켜지면 고해자가 자신의 이야기를 털어놓을 수 있는 시간이 시작된다. AI 예수가 답할 차례에는 빨간색 불이 켜져 음성이 인식되지 않는다. 익명성이 보장된 방문객들은 스크린을 통해 홀로그램 예수 아바타를 바라보며 고민을 털어놓는다. 두 달 동안 1000명 이상이 방문해 AI 예수와 신비로운 대화를 나누며 직접 신앙적 경험을 했다. 일부 방문객은 두 번 이상 방문하기도 했다. 방문객 중에는 무슬림과 아시아 관광객들도 있었다. 이들은 진정한 사랑과 내세, 전쟁과 현실 세계의 고통, 신의 존재, 동성애 등 심오하고 다양한 주제에 대해 깊이 있는 대화를 나눴다. AI 예수는 성경에 근거한 답변을 제시하면서 종교적 조언과 위로를 했다. 방문객 중 약 230명은 피드백을 남겼다. 230명의 피드백 중 약 3분의2는 AI 예수와의 만남에서 영적 경험 을 느꼈다는 소감을 밝혔다. 행복하고 영감을 주는 훌륭한 답변을 내놓았다고도 했다. AI 기술로 인해 더욱 풍성해진 신앙 체험을 긍정적으로 평가한 것이다. 이 같은 반응에 이 프로젝트를 이끈 교회의 신학자 마르코 슈미트는 사람들이 AI 예수와 진지하게 대화를 나눴다는 점이 흥미롭고, 예수와 대화하고 싶어 하는 사람들의 갈증을 보게 됐다 며 이 프로젝트가 단순한 기술의 발전을 넘어 인간 존재의 깊이를 탐구하는 중요한 경험임을 암시했다 고 설명했다. 기계 속의 신 을 기획한 예술가들 또한 AI가 종교 체험을 확장하는 흥미로운 도구가 될 수 있다고 강조했다. 반면 일부 방문객들은 AI의 답변이 피상적이고 진부하다는 혹평을 내놨다. 인간적인 온기나 깊이를 느낄 수 없었다는 불만을 토로하기도 했다. AI가 가진 한계를 명확히 느꼈다는 것이다. 또 가톨릭과 개신교 양쪽 모두 AI와 신앙을 경계하는 우려와 비판의 목소리를 높였다. 이 같은 시도를 신성 모독 이라 비판하거나 악마의 작품 으로 폄하하며 거부감을 표출했다. 한편 독일 바이에른주의 성바울 교회 에서는 수염을 기른 흑인 남성의 모습을 한 AI 목사가 예배를 진행해 눈길을 끌었다. 챗GPT를 통해 구현된 흑인 남성 아바타는 제단 위의 대형 스크린을 통해 신자들과 만났다. AI 목사는 40분 동안 설교, 기도, 찬송 등 예배를 이끌었다. 이 예배에는 약 300명의 신자가 참석했다. AI 목사가 설교 기도 찬송하며 예배 AI 예배를 기획한 사람은 빈대학교의 신학자인 요나스 심머라인이다. 그는 챗GPT에 간단한 명령어를 입력해 종교 대본을 작성했다. AI에 우리는 교회에 있고 당신은 설교자인데 교회 예배는 어떤 모습일까요? 라고 물어봤고, 전체 예배 진행의 약 98 를 기계가 제공했다고 한다. 아바타의 모습으로 등장한 AI 목사는 친애하는 여러분, 올해 독일에서 열린 개신교 집회에서 AI로는 처음으로 설교를 하게 되어 영광 이라며 말문을 열었다. 이어 과거를 뒤로하고 현재의 도전에 집중하며, 죽음을 두려워하지 말고, 예수 그리스도에 대한 믿음을 절대 잃지 말아야 한다 는 설교 내용을 전했다. AI 예배에 대한 신자들의 반응은 극명하게 엇갈렸다. 일부는 AI 목사가 전하는 메시지가 매우 인상 깊다 고 환호했다. 휴대전화로 촬영까지 하며 기술과 종교의 융합 가능성에 긍정적인 기대감을 드러냈다. 하지만 불쾌한 기색을 보이는 신자들도 있었다. 심장도, 영혼도 없는 예배 경험이었다 며 AI 목사의 말이 너무 빠르고 전혀 감정을 드러내지 않는 무표정한 얼굴 탓에 예배에 집중하기 힘들었다 는 반응을 나타냈다. 그러면서도 이런 것에 익숙한 젊은 세대들에게는 새로운 소통 방식의 시도일 수 있겠다 고 말했다. 2023년 9월 미국 텍사스 오스틴에 위치한 바이올렛 크라운 시티교회 에서도 AI를 활용한 예배를 시도한 적이 있다. 담임목사인 제이 쿠퍼가 AI 언어 모델인 챗GPT를 활용해 설교와 찬양곡을 작성하고, 예배 전반을 구성하는 실험을 진행했다. 교인들의 참여와 소통을 더 원활하게 하기 위해 예배 방식을 바꿔보려 한 것이다. 이 교회는 성소수자의 권리를 지지한다. 하지만 결국 쿠퍼 목사는 AI로 만들어낸 예배에 중대한 결함이 있다는 사실을 인정했다. 당시 예배가 인간적인 요소가 부족한 로봇과 같은 느낌이 들었고, 영적인 깊이가 부족해 실패했다 면서 우리가 해냈지만, 그러나 다시는 그렇게 하지 않겠다 고 결론 내렸다. AI 예배는 호불호가 갈린다. 인간성을 결여한 AI가 전하는 설교와 찬양이 사람에게 감동을 이끌어내긴 힘들 수 있다. 결국 AI와 종교를 어떻게 조화시켜 인간 내면의 영적 갈구를 채워주느냐가 숙제이자 기회가 될 것이다. 출처 : 주간조선 http://weekly.chosun.com"
}