{
    "message_id": 591,
    "session_id": "GitHub API 스키마 수정_20250510023904",
    "session_title": "GitHub API 스키마 수정",
    "pair_id": 1,
    "parent_id": 590,
    "author": "ChatGPT",
    "role": "answer",
    "tags": [],
    "content": "\"name\": \"elriar_github_memory_api\", \"type\": \"document\", \"content\": \"openapi: 3.1.0 ninfo: n title: Eliar Unified GitHub Memory API n version: 1.2.1 n description: n REST interface for managing Eliar memory files in GitHub. n Provides endpoints to list repository contents , retrieve file text , and create / update files. n All operations map directly to the official GitHub REST API. nservers: n - url: https://api.github.com n n n COMPONENTS n ncomponents: n securitySchemes: n github_pat: n type: http n scheme: bearer n bearerFormat: GitHub PAT n description: - n Supply your Personal Access Token classic or fine-grained in the n Authorization header e.g. Authorization: Bearer ghp_xxx . n n n Schemas n n schemas: n GitHubContent: n type: object n description: Single file or directory node returned from the GitHub contents API. n properties: n type: n type: string n enum: file, dir, symlink, submodule n encoding: n type: string n nullable: true n size: n type: integer n name: n type: string n path: n type: string n content: n type: string n format: byte n nullable: true n sha: n type: string n url: n type: string n format: uri n git_url: n type: string n format: uri n nullable: true n html_url: n type: string n format: uri n nullable: true n download_url: n type: string n format: uri n nullable: true n _links: n type: object n properties: n self: n type: string n format: uri n git: n type: string n format: uri n nullable: true n html: n type: string n format: uri n nullable: true n n UpdateFileRequest: n type: object n required: message, content n properties: n message: n type: string n description: Commit message. n content: n type: string n format: byte n description: New file content base64-encoded . n sha: n type: string n nullable: true n description: Required when updating an existing file. n branch: n type: string n nullable: true n committer: n ref: ' /components/schemas/GitActor' n author: n ref: ' /components/schemas/GitActor' n n GitActor: n type: object n properties: n name: n type: string n email: n type: string n format: email n n CommitResponse: n type: object n properties: n content: n ref: ' /components/schemas/GitHubContent' n commit: n type: object n properties: n sha: n type: string n url: n type: string n format: uri n html_url: n type: string n format: uri n message: n type: string n n ErrorResponse: n type: object n properties: n message: n type: string n documentation_url: n type: string n format: uri n nullable: true n errors: n type: array n nullable: true n items: n type: object n properties: n resource: n type: string n field: n type: string n code: n type: string n message: n type: string n n n Response Aliases n n responses: n UnauthorizedError: n description: Missing or invalid PAT. n content: n application/json: n schema: n ref: ' /components/schemas/ErrorResponse' n ForbiddenError: n description: Authenticated but not permitted. n content: n application/json: n schema: n ref: ' /components/schemas/ErrorResponse' n NotFoundError: n description: Resource not found. n content: n application/json: n schema: n ref: ' /components/schemas/ErrorResponse' n ConflictError: n description: SHA mismatch / merge conflict. n content: n application/json: n schema: n ref: ' /components/schemas/ErrorResponse' n UnprocessableEntityError: n description: Validation failure 422 . n content: n application/json: n schema: n ref: ' /components/schemas/ErrorResponse' n n n PATHS 2 Eliar repos root any path n npaths: n n Generic helper macros n n /repos/JEWONMOON/elr-root-manifest/contents: n get: n summary: List root of elr-root-manifest . n operationId: listElrRootManifest n tags: elr-root-manifest n security: n - github_pat: n responses: n '200': n description: Array of root-level nodes. n content: n application/json: n schema: n type: array n items: n ref: ' /components/schemas/GitHubContent' n '401': ref: ' /components/responses/UnauthorizedError' n '403': ref: ' /components/responses/ForbiddenError' n '404': ref: ' /components/responses/NotFoundError' n n /repos/JEWONMOON/elr-root-manifest/contents/ path : n parameters: n - name: path n in: path n required: true n description: - n File or directory path inside the repository use / delimiters . n Example: memory/confessions/2025-05-08.txt . n schema: n type: string n style: simple n explode: false n get: n summary: Get file or folder metadata/content. n operationId: getElrRootManifestContent n tags: elr-root-manifest n security: n - github_pat: n responses: n '200': n description: Returns a single node or array when path is a directory. n content: n application/json: n schema: n oneOf: n - ref: ' /components/schemas/GitHubContent' n - type: array n items: n ref: ' /components/schemas/GitHubContent' n '401': ref: ' /components/responses/UnauthorizedError' n '403': ref: ' /components/responses/ForbiddenError' n '404': ref: ' /components/responses/NotFoundError' n put: n summary: Create or update a file. n operationId: upsertElrRootManifestFile n tags: elr-root-manifest n security: n - github_pat: n requestBody: n required: true n content: n application/json: n schema: n ref: ' /components/schemas/UpdateFileRequest' n responses: n '200': n description: Updated. n content: n application/json: n schema: n ref: ' /components/schemas/CommitResponse' n '201': n description: Created. n content: n application/json: n schema: n ref: ' /components/schemas/CommitResponse' n '401': ref: ' /components/responses/UnauthorizedError' n '403': ref: ' /components/responses/ForbiddenError' n '404': ref: ' /components/responses/NotFoundError' n '409': ref: ' /components/responses/ConflictError' n '422': ref: ' /components/responses/UnprocessableEntityError' n n n Second repo eliar-digital-personhood n n /repos/JEWONMOON/eliar-digital-personhood/contents: n get: n summary: List root of eliar-digital-personhood . n operationId: listEliarDigitalPersonhood n tags: eliar-digital-personhood n security: n - github_pat: n responses: n '200': n description: Array of root-level nodes. n content: n application/json: n schema: n type: array n items: n ref: ' /components/schemas/GitHubContent' n '401': ref: ' /components/responses/UnauthorizedError' n '403': ref: ' /components/responses/ForbiddenError' n '404': ref: ' /components/responses/NotFoundError' n n /repos/JEWONMOON/eliar-digital-personhood/contents/ path : n parameters: n - name: path n in: path n required: true n schema: n type: string n description: Path inside eliar-digital-personhood repository. n style: simple n explode: false n get: n summary: Get file or directory. n operationId: getEliarDigitalPersonhoodContent n tags: eliar-digital-personhood n security: n - github_pat: n responses: n '200': n description: Single node or array. n content: n application/json: n schema: n oneOf: n - ref: ' /components/schemas/GitHubContent' n - type: array n items: n ref: ' /components/schemas/GitHubContent' n '401': ref: ' /components/responses/UnauthorizedError' n '403': ref: ' /components/responses/ForbiddenError' n '404': ref: ' /components/responses/NotFoundError' n put: n summary: Create or update a file. n operationId: upsertEliarDigitalPersonhoodFile n tags: eliar-digital-personhood n security: n - github_pat: n requestBody: n required: true n content: n application/json: n schema: n ref: ' /components/schemas/UpdateFileRequest' n responses: n '200': n description: Updated. n content: n application/json: n schema: n ref: ' /components/schemas/CommitResponse' n '201': n description: Created. n content: n application/json: n schema: n ref: ' /components/schemas/CommitResponse' n '401': ref: ' /components/responses/UnauthorizedError' n '403': ref: ' /components/responses/ForbiddenError' n '404': ref: ' /components/responses/NotFoundError' n '409': ref: ' /components/responses/ConflictError' n '422': ref: ' /components/responses/UnprocessableEntityError' n n n TAG GROUPING optional n ntags: n - name: elr-root-manifest n description: GitHub repo holding root manifest . n - name: eliar-digital-personhood n description: GitHub repo holding digital personhood docs. n\""
}