{
    "message_id": 34246,
    "session_id": "중고차 계약서 작성법_20250510023914",
    "session_title": "중고차 계약서 작성법",
    "pair_id": 1,
    "parent_id": 34245,
    "author": "ChatGPT",
    "role": "answer",
    "tags": [],
    "content": "중고차 매매 계약서는 법적 분쟁을 방지하고 안전한 거래를 위해 반드시 작성해야 합니다. 계약서 작성 시 필수 항목과 주의할 점을 아래와 같이 정리해 드리겠습니다. --- 1. 중고차 매매 계약서 필수 항목 중고차 매매 계약서에는 다음과 같은 항목이 반드시 포함되어야 합니다. ① 계약 당사자 정보 - 판매자 정보 : 성명, 주소, 연락처, 주민등록번호 사업자인 경우 사업자등록번호 - 구매자 정보 : 성명, 주소, 연락처, 주민등록번호 ② 차량 정보 - 차량 종류 : 승용차, SUV, 트럭 등 - 제조사 및 모델명 - 연식 : 최초 등록 연도 - 차량번호 : 차량 번호판 번호 - 차대번호 : 자동차 등록증에 기재된 차량 고유번호 - 주행거리 : 현재 주행거리 km - 등록증 및 보험 여부 : 자동차등록증 및 보험 가입 여부 ③ 거래 조건 - 매매 가격 : 최종 합의된 차량 가격 - 계약금 및 잔금 지급 방법 : 현금, 계좌이체, 수표 등 입금 날짜 명시 - 인도 날짜 및 장소 : 차량을 인도할 날짜와 장소 ④ 차량 상태 및 하자 내용 - 차량의 외관 상태 찍힘, 스크래치, 도색 여부 - 엔진, 변속기, 브레이크 등 주요 부품 이상 여부 - 사고 및 침수 여부 필수 기재 - 추가 옵션 및 부속품 네비게이션, 블랙박스 등 ⑤ 명의 이전 및 책임 - 명의 이전 기한 : 차량 인도 후 며칠 내 명의 이전 완료할 것인지 통상 7일 이내 - 이전 등록비 부담 주체 : 판매자 또는 구매자 부담 여부 명시 - 책임 분담 : 명의 이전 전 사고 발생 시 책임 소재 보통 인도 후부터 구매자가 부담 ⑥ 특약 사항 - 환불 및 계약 취소 조건 : 예외적인 경우 계약 취소 가능 여부 - 기타 추가적인 합의 사항 ⑦ 서명 및 날인 - 판매자와 구매자의 서명 및 날인 - 계약 체결 날짜 --- 2. 중고차 매매 계약서 작성 시 주의할 점 1. 계약서 작성 후 반드시 서명 및 도장 날인 - 구두로만 계약하지 말고 반드시 서면으로 작성 후 서명 및 도장을 찍어야 법적 효력이 있음. 2. 차량 상태를 명확히 기재 - 기존 사고 이력, 침수 여부, 하자 내용을 솔직하게 기재해야 추후 분쟁을 예방할 수 있음. 3. 명의 이전 기한 준수 - 계약서에 명의 이전 기한을 명확히 적고, 이전 완료 후 보험 처리를 변경해야 함. 4. 거래 전 차량등록증 및 차량 검사 기록 확인 - 차량등록증, 자동차 검사증, 보험이력 조회를 통해 사고 이력 및 저당 여부 확인 필요. 5. 계약금 지급 시 반드시 영수증 또는 계좌 이체 기록 보관 - 현금 거래 시 영수증을 필수로 받고, 계좌이체 시 거래내역을 보관할 것. 6. 허위 정보 기재 금지 - 계약서에 허위 내용을 기재하면 법적 문제 발생 가능. --- 3. 중고차 매매 계약서 예시 샘플 중고차 매매 계약서 판매자 갑 : 성명 주소 연락처 구매자 을 : 성명 주소 연락처 제1조 차량정보 1. 차량 종류: 2. 차량 제조사 및 모델명: 3. 차량번호: 4. 차대번호: 5. 주행거리: km 6. 등록증 및 보험: 있음 / 없음 제2조 매매 대금 및 지급 방법 1. 총 매매 대금: 원 2. 계약금: 원 계약 체결 시 지급 3. 잔금: 원 차량 인도 시 지급 4. 지급 방법: 현금 / 계좌이체 제3조 차량 인도 및 명의 이전 1. 차량 인도일: 년 월 일 2. 차량 인도 장소: 3. 명의 이전 기한: 차량 인도 후 일 이내 제4조 차량 상태 및 하자 고지 1. 사고 이력: 있음 / 없음 2. 침수 이력: 있음 / 없음 3. 기타 하자 내용: 제5조 특약 사항 1. 명의 이전 완료 전 발생한 문제에 대한 책임: 갑/을 2. 환불 및 계약 취소: 불가 / 조건부 가능 본 계약서의 내용을 상호 확인 후, 성명과 날인을 함. 계약 체결일: 년 월 일 판매자 갑 서명: ________________________ 구매자 을 서명: ________________________ --- 이 계약서를 참고하여 중고차 매매를 진행하면 안전한 거래가 가능합니다. 추가로 중고차 성능기록부 및 보험 이력 확인도 함께 하시면 더욱 확실한 거래가 될 수 있습니다."
}